Examples/FvOptions/heatExchangerSources/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     chtMultiRegionSimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         2000;

deltaT          1;

writeControl    timeStep;

writeInterval   50;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression on;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

libs (
    "libswakFvOptions.so"
    "libsimpleSwakFunctionObjects.so"
);

functions {
    energyChangeAir {
        type swakExpression;
        valueType internalField;
        region air;
        expression "fvChangeAirh";
        verbose true;
        accumulations (
            min
            max
            integrate
        );
    }
    energyChangePorous {
        $energyChangeAir;
        region porous;
        expression "fvChangeh";
    }
    residualEnergyAir {
        $energyChangeAir;
        expression "residualAirh";
    }
    residualEnergyPorous {
        $energyChangePorous;
        expression "residualh";
    }
    residualMomentumAir {
        $residualEnergyAir;
        expression "residualU";
    }
    residualTurbKAir {
        $residualEnergyAir;
        expression "residualk";
    }
    residualTurbEpsAir {
        $residualEnergyAir;
        expression "residualepsilon";
    }
}
// ************************************************************************* //
